## Напишите программу, которая считывает длины катета и высоты в прямоугольном треугольнике 
## и выводит его площадь. Каждое число записано в отдельной строке

a = int(input('Введите катет '))
h = int(input('Введите высоту '))

print(f'S={1/2*a*h}')
